alexandersage.angular1-code-snippets
angular.ng-template
anseki.vscode-color
bradlc.vscode-tailwindcss
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
devzstudio.emoji-snippets
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
glenn2223.live-sass
google.gemini-cli-vscode-ide-companion
humao.rest-client
johnpapa.angular2
jprestidge.theme-material-theme
lihui.vs-color-picker
mongodb.mongodb-vscode
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-vscode.powershell
msjsdiag.vscode-react-native
oderwat.indent-rainbow
ofhumanbondage.react-proptypes-intellisense
oouo-diogo-perdigao.docthis
perkovec.emoji
pkief.material-icon-theme
ritwickdey.liveserver
salbert.comment-ts
solomonkinard.git-blame
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
teabyii.ayu
thekalinga.bootstrap4-vscode
thomaspink.theme-github
unifiedjs.vscode-mdx
vincaslt.highlight-matching-tag
vivaxy.vscode-conventional-commits
vue.volar
wayou.vscode-todo-highlight
xabikos.javascriptsnippets
